<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/a5419c36-2355-40c5-b289-aac2983da5a3/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.aws_alb.network_load_balancer must be replaced
+/- resource "aws_alb" "network_load_balancer" {
      ~ arn                              = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/prod-keyserver-lb-3a8/b386cfa05af63d6b" -> (known after apply)
      ~ arn_suffix                       = "net/prod-keyserver-lb-3a8/b386cfa05af63d6b" -> (known after apply)
      ~ dns_name                         = "prod-keyserver-lb-3a8-b386cfa05af63d6b.elb.eu-central-1.amazonaws.com" -> (known after apply)
      ~ id                               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/prod-keyserver-lb-3a8/b386cfa05af63d6b" -> (known after apply)
      ~ internal                         = false -> (known after apply)
      ~ ip_address_type                  = "ipv4" -> (known after apply)
      ~ name                             = "prod-keyserver-lb-3a8" -> (known after apply)
      ~ security_groups                  = [] -> (known after apply)
      ~ subnets                          = [ # forces replacement
          - "subnet-003e71fe834d8ae89",
          - "subnet-01c85562ab20d9798",
          - "subnet-0ee4ef2c9f8840739",
        ] -> (known after apply) # forces replacement
      - tags                             = {} -> null
      ~ vpc_id                           = "vpc-0de9380f8679bfa0d" -> (known after apply)
      ~ zone_id                          = "Z3F0SRJ5LGBH90" -> (known after apply)
        # (4 unchanged attributes hidden)

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-003e71fe834d8ae89" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-01c85562ab20d9798" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0ee4ef2c9f8840739" -> null
        }
    }

  # module.ecs.aws_appautoscaling_policy.ecs_target_cpu will be created
  + resource "aws_appautoscaling_policy" "ecs_target_cpu" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "application-scaling-policy-cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/prod_keyserver_cluster/prod_keyserver-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.ecs_target_memory will be created
  + resource "aws_appautoscaling_policy" "ecs_target_memory" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "application-scaling-policy-memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/prod_keyserver_cluster/prod_keyserver-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_target.ecs_target will be created
  + resource "aws_appautoscaling_target" "ecs_target" {
      + id                 = (known after apply)
      + max_capacity       = 8
      + min_capacity       = 2
      + resource_id        = "service/prod_keyserver_cluster/prod_keyserver-service"
      + role_arn           = "arn:aws:iam::898587786287:role/prod_keyserver-ecs-scale-application"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # module.ecs.aws_ecs_service.app_service will be created
  + resource "aws_ecs_service" "app_service" {
      + cluster                            = "arn:aws:ecs:eu-central-1:898587786287:cluster/prod_keyserver_cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "prod_keyserver-service"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "TASK_DEFINITION"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Application"      = "keyserver"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = true

      + load_balancer {
          + container_name   = "prod_keyserver"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs.aws_ecs_task_definition.app_task will be created
  + resource "aws_ecs_task_definition" "app_task" {
      + arn                      = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::898587786287:role/prod_keyserver_ecs_task_execution_role"
      + family                   = "prod_keyserver"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Application"      = "keyserver"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + task_role_arn            = "arn:aws:iam::898587786287:role/prod_keyserver_ecs_task_execution_role"

      + runtime_platform {
          + operating_system_family = "LINUX"
        }
    }

  # module.ecs.aws_lb_listener.listener must be replaced
+/- resource "aws_lb_listener" "listener" {
      ~ arn               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/prod-keyserver-lb-3a8/b386cfa05af63d6b/e5607c95c34a4423" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/prod-keyserver-lb-3a8/b386cfa05af63d6b/e5607c95c34a4423" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/prod-keyserver-lb-3a8/b386cfa05af63d6b" # forces replacement -> (known after apply) # forces replacement
      - tags              = {} -> null
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/prod-keyserver-4e6/0de87e574afd3da4" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.ecs.aws_lb_target_group.target_group must be replaced
+/- resource "aws_lb_target_group" "target_group" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/prod-keyserver-4e6/0de87e574afd3da4" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/prod-keyserver-4e6/0de87e574afd3da4" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/prod-keyserver-4e6/0de87e574afd3da4" -> (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      ~ name                               = "prod-keyserver-4e6" -> (known after apply)
      ~ preserve_client_ip                 = "false" -> (known after apply)
      + protocol_version                   = (known after apply)
      - tags                               = {} -> null
      ~ vpc_id                             = "vpc-0de9380f8679bfa0d" # forces replacement -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200-399" -> (known after apply)
          ~ timeout             = 6 -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      - stickiness {
          - cookie_duration = 0 -> null
          - enabled         = false -> null
          - type            = "source_ip" -> null
        }
    }

  # module.ecs.aws_route53_record.dns_load_balancer will be updated in-place
  ~ resource "aws_route53_record" "dns_load_balancer" {
        id      = "Z098781520DYMYC4P6VDC_keys.walletconnect.com_A"
        name    = "keys.walletconnect.com"
        # (5 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "prod-keyserver-lb-3a8-b386cfa05af63d6b.elb.eu-central-1.amazonaws.com" -> null
          - zone_id                = "Z3F0SRJ5LGBH90" -> null
        }
      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.ecs.aws_security_group.tls_ingess will be created
  + resource "aws_security_group" "tls_ingess" {
      + arn                    = (known after apply)
      + description            = "Allow tls ingress from everywhere"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "prod_keyserver-tls-ingress"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Application"      = "keyserver"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecs.aws_security_group.vpc_app_ingress will be created
  + resource "aws_security_group" "vpc_app_ingress" {
      + arn                    = (known after apply)
      + description            = "Allow app port ingress from vpc"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "prod_keyserver-vpc-ingress-to-app"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Application"      = "keyserver"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # module.keystore_docdb.aws_docdb_cluster_instance.docdb_instances[0] will be created
  + resource "aws_docdb_cluster_instance" "docdb_instances" {
      + apply_immediately            = (known after apply)
      + arn                          = (known after apply)
      + auto_minor_version_upgrade   = true
      + availability_zone            = (known after apply)
      + ca_cert_identifier           = (known after apply)
      + cluster_identifier           = "prod-keyserver-keystore-docdb-primary-cluster"
      + db_subnet_group_name         = (known after apply)
      + dbi_resource_id              = (known after apply)
      + endpoint                     = (known after apply)
      + engine                       = "docdb"
      + engine_version               = (known after apply)
      + id                           = (known after apply)
      + identifier                   = "prod-keyserver-keystore-docdb-primary-instance-0"
      + identifier_prefix            = (known after apply)
      + instance_class               = "db.r6g.large"
      + kms_key_id                   = (known after apply)
      + port                         = (known after apply)
      + preferred_backup_window      = (known after apply)
      + preferred_maintenance_window = (known after apply)
      + promotion_tier               = 0
      + publicly_accessible          = (known after apply)
      + storage_encrypted            = (known after apply)
      + tags_all                     = {
          + "Application"      = "keyserver"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + writer                       = (known after apply)
    }

  # module.keystore_docdb.aws_docdb_cluster_instance.docdb_replica_instances[0] will be created
  + resource "aws_docdb_cluster_instance" "docdb_replica_instances" {
      + apply_immediately            = (known after apply)
      + arn                          = (known after apply)
      + auto_minor_version_upgrade   = true
      + availability_zone            = (known after apply)
      + ca_cert_identifier           = (known after apply)
      + cluster_identifier           = "prod-keyserver-keystore-docdb-primary-cluster"
      + db_subnet_group_name         = (known after apply)
      + dbi_resource_id              = (known after apply)
      + endpoint                     = (known after apply)
      + engine                       = "docdb"
      + engine_version               = (known after apply)
      + id                           = (known after apply)
      + identifier                   = "prod-keyserver-keystore-docdb-replica-instance-0"
      + identifier_prefix            = (known after apply)
      + instance_class               = "db.r6g.large"
      + kms_key_id                   = (known after apply)
      + port                         = (known after apply)
      + preferred_backup_window      = (known after apply)
      + preferred_maintenance_window = (known after apply)
      + promotion_tier               = 1
      + publicly_accessible          = (known after apply)
      + storage_encrypted            = (known after apply)
      + tags_all                     = {
          + "Application"      = "keyserver"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + writer                       = (known after apply)
    }

  # module.o11y.data.jsonnet_file.dashboard will be read during apply
  # (config refers to values not yet known)
 <= data "jsonnet_file" "dashboard" {
      + ext_str  = {
          + "cloudwatch_uid"   = "P2kGF7Q4k"
          + "dashboard_title"  = "prod - keyserver"
          + "dashboard_uid"    = "prod-keyserver"
          + "docdb_cluster_id" = "prod-keyserver-keystore-docdb-primary-cluster"
          + "ecs_service_name" = "prod_keyserver-service"
          + "environment"      = "prod"
          + "load_balancer"    = (known after apply)
          + "notifications"    = jsonencode(
                [
                  + {
                      + uid = "NNOynGwVz"
                    },
                ]
            )
          + "prometheus_uid"   = "3EqgoK64k"
          + "target_group"     = (known after apply)
        }
      + id       = (known after apply)
      + rendered = (known after apply)
      + source   = "monitoring/dashboard.jsonnet"
    }

  # module.o11y.grafana_dashboard.main will be updated in-place
  ~ resource "grafana_dashboard" "main" {
      ~ config_json  = jsonencode(
            {
              - __inputs      = []
              - __requires    = []
              - annotations   = {
                  - list = [
                      - {
                          - builtIn    = 1
                          - datasource = "-- Grafana --"
                          - enable     = true
                          - hide       = true
                          - iconColor  = "rgba(0, 211, 255, 1)"
                          - name       = "Annotations & Alerts"
                          - showIn     = 0
                          - target     = {
                              - limit    = 100
                              - matchAny = false
                              - tags     = []
                              - type     = "dashboard"
                            }
                          - type       = "dashboard"
                        },
                    ]
                }
              - editable      = true
              - gnetId        = null
              - graphTooltip  = 1
              - hideControls  = false
              - links         = []
              - liveNow       = false
              - panels        = [
                  - {
                      - alert         = {
                          - alertRuleTags       = {}
                          - conditions          = [
                              - {
                                  - evaluator = {
                                      - params = [
                                          - 50,
                                        ]
                                      - type   = "gt"
                                    }
                                  - operator  = {
                                      - type = "or"
                                    }
                                  - query     = {
                                      - params = [
                                          - "CPU_Avg",
                                          - "25m",
                                          - "now",
                                        ]
                                    }
                                  - reducer   = {
                                      - params = []
                                      - type   = "max"
                                    }
                                  - type      = "query"
                                },
                              - {
                                  - evaluator = {
                                      - params = [
                                          - 50,
                                        ]
                                      - type   = "gt"
                                    }
                                  - operator  = {
                                      - type = "or"
                                    }
                                  - query     = {
                                      - params = [
                                          - "Mem_Avg",
                                          - "25m",
                                          - "now",
                                        ]
                                    }
                                  - reducer   = {
                                      - params = []
                                      - type   = "max"
                                    }
                                  - type      = "query"
                                },
                            ]
                          - executionErrorState = "alerting"
                          - for                 = "25m"
                          - frequency           = "1m"
                          - handler             = 1
                          - message             = "prod Keyserver App CPU/Memory"
                          - name                = "prod Keyserver App CPU/Memory alert"
                          - noDataState         = "alerting"
                          - notifications       = []
                        }
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "P2kGF7Q4k"
                        }
                      - description   = null
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 30
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "area"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "red"
                                          - value = 50
                                        },
                                    ]
                                }
                              - unit       = "percent"
                            }
                          - overrides = [
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "CPU_Max"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "dark-blue"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "CPU_Avg"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "blue"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "Mem_Max"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "dark-purple"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "Mem_Avg"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "purple"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                            ]
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 12
                          - x = 0
                          - y = 0
                        }
                      - links         = []
                      - options       = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                            }
                          - tooltip = {
                              - mode = "multi"
                              - sort = "none"
                            }
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - alias            = "CPU (Max)"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {
                                  - ServiceName = "prod_keyserver-service"
                                }
                              - expression       = ""
                              - matchExact       = false
                              - metricEditorMode = 0
                              - metricName       = "CPUUtilization"
                              - metricQueryType  = 0
                              - namespace        = "AWS/ECS"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "CPU_Max"
                              - region           = "default"
                              - statistic        = "Maximum"
                            },
                          - {
                              - alias            = "CPU (Avg)"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {
                                  - ServiceName = "prod_keyserver-service"
                                }
                              - expression       = ""
                              - matchExact       = false
                              - metricEditorMode = 0
                              - metricName       = "CPUUtilization"
                              - metricQueryType  = 0
                              - namespace        = "AWS/ECS"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "CPU_Avg"
                              - region           = "default"
                              - statistic        = "Average"
                            },
                          - {
                              - alias            = "Memory (Max)"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {
                                  - ServiceName = "prod_keyserver-service"
                                }
                              - expression       = ""
                              - matchExact       = false
                              - metricEditorMode = 0
                              - metricName       = "MemoryUtilization"
                              - metricQueryType  = 0
                              - namespace        = "AWS/ECS"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "Mem_Max"
                              - region           = "default"
                              - statistic        = "Maximum"
                            },
                          - {
                              - alias            = "Memory (Avg)"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {
                                  - ServiceName = "prod_keyserver-service"
                                }
                              - expression       = ""
                              - matchExact       = false
                              - metricEditorMode = 0
                              - metricName       = "MemoryUtilization"
                              - metricQueryType  = 0
                              - namespace        = "AWS/ECS"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "Mem_Avg"
                              - region           = "default"
                              - statistic        = "Average"
                            },
                        ]
                      - title         = "App CPU/Memory"
                      - type          = "timeseries"
                    },
                  - {
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "P2kGF7Q4k"
                        }
                      - description   = null
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 5
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "off"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 12
                          - x = 12
                          - y = 0
                        }
                      - links         = []
                      - options       = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                            }
                          - tooltip = {
                              - mode = "multi"
                              - sort = "none"
                            }
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - alias            = "Hosts Count"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {}
                              - expression       = ""
                              - matchExact       = false
                              - metricEditorMode = 0
                              - metricName       = "HealthyHostCount"
                              - metricQueryType  = 1
                              - namespace        = "AWS/NetworkELB"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "A"
                              - region           = "default"
                              - sql              = {
                                  - from   = {
                                      - property = {
                                          - name = "AWS/NetworkELB"
                                          - type = "string"
                                        }
                                      - type     = "property"
                                    }
                                  - select = {
                                      - name       = "MAX"
                                      - parameters = [
                                          - {
                                              - name = "HealthyHostCount"
                                              - type = "functionParameter"
                                            },
                                        ]
                                      - type       = "function"
                                    }
                                  - where  = {
                                      - expressions = [
                                          - {
                                              - operator = {
                                                  - name  = "="
                                                  - value = "net/prod-keyserver-lb-3a8/b386cfa05af63d6b"
                                                }
                                              - property = {
                                                  - name = "LoadBalancer"
                                                  - type = "string"
                                                }
                                              - type     = "operator"
                                            },
                                        ]
                                      - type        = "and"
                                    }
                                }
                              - sqlExpression    = "SELECT MAX(HealthyHostCount) FROM \"AWS/NetworkELB\" WHERE LoadBalancer = 'net/prod-keyserver-lb-3a8/b386cfa05af63d6b'"
                              - statistic        = "Average"
                            },
                        ]
                      - title         = "Healthy Hosts"
                      - type          = "timeseries"
                    },
                  - {
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "P2kGF7Q4k"
                        }
                      - description   = null
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 100
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "off"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 12
                          - x = 0
                          - y = 8
                        }
                      - links         = []
                      - options       = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                            }
                          - tooltip = {
                              - mode = "multi"
                              - sort = "none"
                            }
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - alias            = "LB-0"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {
                                  - LoadBalancer = "net/prod-keyserver-lb-3a8/b386cfa05af63d6b"
                                }
                              - expression       = ""
                              - matchExact       = true
                              - metricEditorMode = 0
                              - metricName       = "ActiveFlowCount_TLS"
                              - metricQueryType  = 0
                              - namespace        = "AWS/NetworkELB"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "A"
                              - region           = "default"
                              - statistic        = "Maximum"
                            },
                        ]
                      - title         = "Active NLB Flows"
                      - type          = "timeseries"
                    },
                  - {
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "P2kGF7Q4k"
                        }
                      - description   = "When the NLB has connection failures to the targets then these jump. We for instance had this when we had a too low file descriptor limit."
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 250
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "off"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "red"
                                          - value = 80
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 12
                          - x = 12
                          - y = 8
                        }
                      - links         = []
                      - options       = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                            }
                          - tooltip = {
                              - mode = "multi"
                              - sort = "none"
                            }
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - alias            = "LB-0"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {
                                  - LoadBalancer = "net/prod-keyserver-lb-3a8/b386cfa05af63d6b"
                                }
                              - expression       = ""
                              - matchExact       = true
                              - metricEditorMode = 0
                              - metricName       = "TCP_Target_Reset_Count"
                              - metricQueryType  = 0
                              - namespace        = "AWS/NetworkELB"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "A"
                              - region           = "default"
                              - statistic        = "Sum"
                            },
                        ]
                      - title         = "NLB Target Resets"
                      - type          = "timeseries"
                    },
                  - {
                      - content     = "# DocumentDB"
                      - datasource  = null
                      - gridPos     = {
                          - h = 4
                          - w = 24
                          - x = 0
                          - y = 16
                        }
                      - mode        = "markdown"
                      - title       = ""
                      - transparent = true
                      - type        = "text"
                    },
                  - {
                      - alert         = {
                          - alertRuleTags       = {}
                          - conditions          = [
                              - {
                                  - evaluator = {
                                      - params = [
                                          - 50,
                                        ]
                                      - type   = "gt"
                                    }
                                  - operator  = {
                                      - type = "or"
                                    }
                                  - query     = {
                                      - params = [
                                          - "CPU_Max",
                                          - "5m",
                                          - "now",
                                        ]
                                    }
                                  - reducer   = {
                                      - params = []
                                      - type   = "avg"
                                    }
                                  - type      = "query"
                                },
                            ]
                          - executionErrorState = "alerting"
                          - for                 = "5m"
                          - frequency           = "1m"
                          - handler             = 1
                          - message             = "prod Keyserver DocumentDB CPU alert"
                          - name                = "prod Keyserver DocumentDB CPU alert"
                          - noDataState         = "alerting"
                          - notifications       = [
                              - {
                                  - uid = "NNOynGwVz"
                                },
                            ]
                        }
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "P2kGF7Q4k"
                        }
                      - description   = null
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 30
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "area"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "red"
                                          - value = 50
                                        },
                                    ]
                                }
                              - unit       = "percent"
                            }
                          - overrides = [
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "CPU_Max"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "dark-blue"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "CPU_Avg"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "blue"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "Mem_Max"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "dark-purple"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "Mem_Avg"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "purple"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                            ]
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 8
                          - x = 0
                          - y = 20
                        }
                      - links         = []
                      - options       = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                            }
                          - tooltip = {
                              - mode = "multi"
                              - sort = "none"
                            }
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - alias            = "CPU (Max)"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {
                                  - DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster"
                                }
                              - expression       = ""
                              - matchExact       = true
                              - metricEditorMode = 0
                              - metricName       = "CPUUtilization"
                              - metricQueryType  = 0
                              - namespace        = "AWS/DocDB"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "CPU_Max"
                              - region           = "default"
                              - statistic        = "Maximum"
                            },
                          - {
                              - alias            = "CPU (Avg)"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {
                                  - DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster"
                                }
                              - expression       = ""
                              - matchExact       = true
                              - metricEditorMode = 0
                              - metricName       = "CPUUtilization"
                              - metricQueryType  = 0
                              - namespace        = "AWS/DocDB"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "CPU_Avg"
                              - region           = "default"
                              - statistic        = "Average"
                            },
                        ]
                      - title         = "CPU Utilization"
                      - type          = "timeseries"
                    },
                  - {
                      - alert         = {
                          - alertRuleTags       = {}
                          - conditions          = [
                              - {
                                  - evaluator = {
                                      - params = [
                                          - 4000000000,
                                        ]
                                      - type   = "lt"
                                    }
                                  - operator  = {
                                      - type = "and"
                                    }
                                  - query     = {
                                      - params = [
                                          - "Mem_Avg",
                                          - "5m",
                                          - "now",
                                        ]
                                    }
                                  - reducer   = {
                                      - params = []
                                      - type   = "min"
                                    }
                                  - type      = "query"
                                },
                            ]
                          - executionErrorState = "alerting"
                          - for                 = "5m"
                          - frequency           = "1m"
                          - handler             = 1
                          - message             = "prod Keyserver DocumentDB Freeable Memory"
                          - name                = "prod Keyserver DocumentDB Freeable Memory Alert"
                          - noDataState         = "alerting"
                          - notifications       = [
                              - {
                                  - uid = "NNOynGwVz"
                                },
                            ]
                        }
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "P2kGF7Q4k"
                        }
                      - description   = null
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 16000000000
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "area"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - steps = [
                                      - {
                                          - color = "red"
                                          - value = null
                                        },
                                      - {
                                          - color = "green"
                                          - value = 4000000000
                                        },
                 
...

```

</details>

*Action: `pull_request`*